# FloorCannotAddDirectionCurveError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..FloorCannotAddDirectionCurveError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Cannot add the direction curve in the floor sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FloorCannotAddDirectionCurveError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorCannotAddDirectionCurveError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FloorCannotAddDirectionCurveError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace